[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:16:8
 
   return (
     <>
-      {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
-        <AppNavbarLocalhost url={currentUrl} />
-      )}
+      {currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000") || <AppNavbarLocalhost url={currentUrl} />}
 
       <Navbar
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] MethodExpression
main/components/Nav/AppNavbar.jsx:16:9
 
   return (
     <>
-      {(currentUrl.startsWith("http://localhost:3000") ||
+      {(currentUrl.endsWith("http://localhost:3000") ||
         currentUrl.startsWith("http://127.0.0.1:3000")) && (
         <AppNavbarLocalhost url={currentUrl} />
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] StringLiteral
main/components/Nav/AppNavbar.jsx:17:31
   return (
     <>
       {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
+        currentUrl.startsWith("")) && (
         <AppNavbarLocalhost url={currentUrl} />
       )}
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<nav
  class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
  data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:41:14
                 <Nav.Link href="/h2-console">H2Console</Nav.Link>
               </>
             )}
-            {systemInfo?.showSwaggerUILink && (
-              <>
-                <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-              </>
-            )}
+            {false}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:63:16
                   <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
                 </NavDropdown>
               )}
-              {currentUser && currentUser.loggedIn ? (
+              {true ? (
                 <>
                   <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="nav-link"
  data-discover="true"
  href="/restaurants"
>
  Restaurants

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:84:16
             </Nav>
 
             <Nav className="ml-auto">
-              {currentUser && currentUser.loggedIn ? (
+              {true ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: Cannot read properties of null (reading 'root')
