[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:28
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const addZ = (string) => `${string}Z`;
+  const addZ = (string) => ``;
 
   const objectToAxiosParams = (recommendationrequest) => ({
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected { …(6) } to deeply equal { …(6) }

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:10:31
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const addZ = (string) => `${string}Z`;
 
-  const objectToAxiosParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationrequest.requesterEmail,
-      professorEmail: recommendationrequest.professorEmail,
-      explanation: recommendationrequest.explanation,
-      dateRequested: addZ(recommendationrequest.dateRequested),
-      dateNeeded: addZ(recommendationrequest.dateNeeded),
-      done: recommendationrequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:25:7
 
   const onSuccess = (recommendationrequest) => {
     toast(
-      `New recommendation request Created - id: ${recommendationrequest.id} requesterEmail: ${recommendationrequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New recommendation request Created - id: 2 requesterEmail: req@gmail.com",
