[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "@tanstack/react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery({
-    queryKey: ["systemInfo"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    initialData: {
-      initialData: true,
-      springH2ConsoleEnabled: true,
-      showSwaggerUILink: true,
-      oauthLogin: "/oauth2/authorization/google",
-      sourceRepo: "https://github.com/ucsb-cs156-f25/STARTER-team02",
-    },
-  });
-}
+export function useSystemInfo() {}
 
killedBy: RestaurantEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.
