[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequests) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequests.id,
-    },
-    data: {
-      id: recommendationRequests.id,
-      requesterEmail: recommendationRequests.requesterEmail,
-      professorEmail: recommendationRequests.professorEmail,
-      explanation: recommendationRequests.explanation,
-      dateRequested: `${recommendationRequests.dateRequested}:00Z`,
-      dateNeeded: `${recommendationRequests.dateNeeded}:00Z`,
-      done: recommendationRequests.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequests) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Recommendation Request Updated - id: 17 Requester email: req1@gmail.com",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:45:49
     },
   });
 
-  const onSuccess = (recommendationRequests) => {
-    toast(
-      `Recommendation Request Updated - id: ${recommendationRequests.id} Requester email: ${recommendationRequests.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequests) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:72:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequests}
-          />
-        )}
+        {recommendationRequests || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationRequests} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:72:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequests}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
