[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:52:42
           type="email"
           placeholder="example: user@ucsb.edu"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "Requester Email is required.",
-            pattern: {
-              value: email_regex,
-              message: "Requester Email must be a valid email address",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester Email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:54:22
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "Requester Email is required.",
-            pattern: {
-              value: email_regex,
-              message: "Requester Email must be a valid email address",
-            },
+            pattern: {},
           })}
         />
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:56:24
             required: "Requester Email is required.",
             pattern: {
               value: email_regex,
-              message: "Requester Email must be a valid email address",
+              message: "",
             },
           })}
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:75:22
           isInvalid={Boolean(errors.teamId)}
           {...register("teamId", {
             required: "Team id is required.",
-            pattern: {
-              value: teamid_regex,
-              message:
-                "Team Id must only contain numbers, letters, dash, and/or underscore.",
-            },
+            pattern: {},
           })}
         />
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Team Id must only contain numbers, letters, dash, and\/or underscore\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:78:17
             pattern: {
               value: teamid_regex,
               message:
-                "Team Id must only contain numbers, letters, dash, and/or underscore.",
+                "",
             },
           })}
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Team Id must only contain numbers, letters, dash, and\/or underscore\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:98:23
           placeholder="numeric value only e.g. 2 (table) or 14 (room)"
           isInvalid={Boolean(errors.tableOrBreakoutRoom)}
           {...register("tableOrBreakoutRoom", {
-            required: "Table or breakout room is required.",
+            required: "",
             maxLength: {
               value: 100,
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Table or breakout room is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:146:24
               message:
                 "Explanation should be thorough and at least 10 characters.",
             },
-            maxLength: {
-              value: 1200,
-              message: "Explanation has a maximum of 1200 characters.",
-            },
+            maxLength: {},
           })}
         />
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Explanation has a maximum of 1200 characters\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:148:24
             },
             maxLength: {
               value: 1200,
-              message: "Explanation has a maximum of 1200 characters.",
+              message: "",
             },
           })}
killedBy: HelpRequestForm tests pattern + maxLength validations and submit testid are enforced
statusReason: Unable to find an element with the text: /Explanation has a maximum of 1200 characters\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:163:34
           data-testid="HelpRequestForm-solved"
           id="solved"
           isInvalid={Boolean(errors.solved)}
-          {...register("solved", {
-            required: "Solved is required.",
-          })}
+          {...register("solved", {})}
         >
           <option value="">Select...</option>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Solved is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
