[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:54:5
       header: "Table Or Breakout Room",
       accessorKey: "tableOrBreakoutRoom",
     },
-    {
-      header: "Request Time (ISO with seconds)",
-      accessorKey: "requestTime",
-    },
+    {},
     {
       header: "Explanation",
killedBy: HelpRequest tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
