[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests when you fill in the form and hit submit, it makes a request to /helpRequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:23:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `New helpRequest Created - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestsCreatePage tests when you fill in the form and hit submit, it makes a request to /helpRequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New helpRequest Created - id: 7 requesterEmail: ealemus@ucsb.edu",
