[Killed] StringLiteral
main/components/Nav/Footer.jsx:13:16
           This is a sample webapp using React with a Spring Boot backend.
           {systemInfo.sourceRepo ? (
             <span data-testid="footer-see-source-code">
-              {" "}
+              {""}
               See the source code on{" "}
               <a
killedBy: Footer tests SystemInfo returns content renders correctly with system info content
statusReason: expected 'This is a sample webapp using React w…' to be 'This is a sample webapp using React w…' // Object.is equality

[Killed] StringLiteral
main/components/Nav/Footer.jsx:16:23
               {" "}
               See the source code on{" "}
               <a
-                href={`${systemInfo.sourceRepo}`}
+                href={``}
                 target="_blank"
                 rel="noopener noreferrer"
killedBy: Footer tests SystemInfo returns content renders correctly with system info content
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156-f25/STARTER-team02") // element.getAttribute("href") === "https://github.com/ucsb-cs156-f25/STARTER-team02"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156-f25/STARTER-team02"
Received:
  href=""
