[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:42:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: RecommmendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:67:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requesterEmail?.message}
+          {errors.requesterEmail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:24
           id="professorEmail"
           type="text"
           isInvalid={Boolean(errors.professorEmail)}
-          {...register("professorEmail", {
+          {...register("", {
             required: "Professor Email is required.",
           })}
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:82:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.professorEmail?.message}
+          {errors.professorEmail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:93:24
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
+          {...register("", {
             required: "Explanation is required.",
             maxLength: {
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:93:39
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "Explanation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:97:24
             required: "Explanation is required.",
             maxLength: {
               value: 255,
-              message: "Max length 255 characters",
+              message: "",
             },
           })}
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:102:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.explanation?.message}
+          {errors.explanation.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:112:41
           id="dateRequested"
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
-          {...register("dateRequested", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateRequested", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:113:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
           {...register("dateRequested", {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:118:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date Requested is required. "}
+          {errors.dateRequested || "Date Requested is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:118:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date Requested is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:128:38
           id="dateNeeded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
-          {...register("dateNeeded", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateNeeded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:129:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
           {...register("dateNeeded", {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:134:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "Date Needed is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:134:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "Date Needed is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:152:12
           <option value="true">true</option>
         </Form.Select>
         <Form.Control.Feedback type="invalid">
-          {errors.done?.message}
+          {errors.done.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommmendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:160:37
       <Button
         variant="Secondary"
         onClick={() => navigate(-1)}
-        data-testid={testIdPrefix + "-cancel"}
+        data-testid={testIdPrefix + ""}
       >
         Cancel
killedBy: RecommmendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
