[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationrequest/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/recommendationrequest/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:48:15
       accessorKey: "requesterEmail",
     },
     {
-      header: "Professor Email",
+      header: "",
       accessorKey: "professorEmail",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Professor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:49:20
     },
     {
       header: "Professor Email",
-      accessorKey: "professorEmail",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:51:5
       header: "Professor Email",
       accessorKey: "professorEmail",
     },
-    {
-      header: "Explanation",
-      accessorKey: "explanation",
-    },
+    {},
     {
       header: "Date Requested (in UTC)",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:53:20
     },
     {
       header: "Explanation",
-      accessorKey: "explanation",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:63:5
       header: "Date Needed (in UTC)",
       accessorKey: "dateNeeded",
     },
-    {
-      header: "Done",
-      accessorKey: "done",
-    },
+    {},
   ];
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:65:20
     },
     {
       header: "Done",
-      accessorKey: "done",
+      accessorKey: "",
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-done"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:69:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:70:31
   ];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("", "primary", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:72:30
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
+      ButtonColumn("Delete", "", deleteCallback, testIdPrefix),
     );
   }
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:72:20
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
+      ButtonColumn("", "danger", deleteCallback, testIdPrefix),
     );
   }
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
