[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "UCSBDiningCommonsMenuItemForm";
+  const testIdPrefix = "";
 
   return (
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:45:23
           type="text"
           isInvalid={Boolean(errors.diningCommonsCode)}
           {...register("diningCommonsCode", {
-            required: "diningCommonsCode is required.",
+            required: "",
           })}
         />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /diningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:50:12
         />
 
         <Form.Control.Feedback type="invalid">
-          {errors.diningCommonsCode?.message}
+          {errors.diningCommonsCode.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:80:35
           id="station"
           type="text"
           isInvalid={Boolean(errors.station)}
-          {...register("station", {
-            required: "station is required.",
-          })}
+          {...register("station", {})}
         />
 
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:86:12
         />
 
         <Form.Control.Feedback type="invalid" >
-          {errors.station?.message}
+          {errors.station.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
