[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:31:21
           id="orgCode"
           type="text"
           isInvalid={Boolean(errors.orgCode)}
-          disabled={!!initialContents} // disable if updating
+          disabled={!initialContents} // disable if updating
           {...register("orgCode", {
             required: "orgCode is required.",
killedBy: UCSBOrganization tests orgCode is ENABLED when creating (no initialContents)
statusReason: expect(element).toBeEnabled()

Received element is not enabled:
  <input
  class="form-control"
  data-testid="UCSBOrganizationForm-orgCode"
  disabled=""
  id="orgCode"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:33:23
           isInvalid={Boolean(errors.orgCode)}
           disabled={!!initialContents} // disable if updating
           {...register("orgCode", {
-            required: "orgCode is required.",
+            required: "",
             maxLength: {
               value: 3,
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: Unable to find an element with the text: /orgCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:34:24
           disabled={!!initialContents} // disable if updating
           {...register("orgCode", {
             required: "orgCode is required.",
-            maxLength: {
-              value: 3,
-              message: "Max length 3 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 3 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:36:24
             required: "orgCode is required.",
             maxLength: {
               value: 3,
-              message: "Max length 3 characters",
+              message: "",
             },
           })}
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 3 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:41:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.orgCode?.message}
+          {errors.orgCode.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBOrganization tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:54:24
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
+          {...register("", {
             required: "orgTranslationShort is required.",
             maxLength: {
killedBy: UCSBOrganization tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:63:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.orgTranslationShort?.message}
+          {errors.orgTranslationShort.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBOrganization tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:70:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="orgTranslation">orgTranslation</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-orgTranslation"}
+          data-testid={testIdPrefix + ""}
           id="orgTranslation"
           type="text"
killedBy: UCSBOrganization tests stable testIds exist for fields and submit button
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgTranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:79:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.orgTranslation?.message}
+          {errors.orgTranslation.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBOrganization tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:86:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="inactive">inactive</Form.Label>
         <Form.Select
-          data-testid={testIdPrefix + "-inactive"}
+          data-testid={testIdPrefix + ""}
           id="inactive"
           isInvalid={Boolean(errors.inactive)}
killedBy: UCSBOrganization tests stable testIds exist for fields and submit button
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:98:12
           <option value="false">false</option>
         </Form.Select>
         <Form.Control.Feedback type="invalid">
-          {errors.inactive?.message}
+          {errors.inactive.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBOrganization tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
