[Killed] BlockStatement
src/main/utils/recommendationRequestUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
src/main/utils/recommendationRequestUtils.js:12:13
   return {
     url: "/api/recommendationrequest",
     method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
+    params: {},
   };
 }
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { id: 2 }
