[Killed] ConditionalExpression
src/main/utils/sortCaretUtils.js:2:7
 export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return "";
+  if (true) return "";
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="sampleTestId"

[Killed] ConditionalExpression
src/main/utils/sortCaretUtils.js:3:7
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return "";
-  if (header.column.getIsSorted() === "asc") {
+  if (false) {
     return "🔼";
   }
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="sampleTestId"

[Killed] EqualityOperator
src/main/utils/sortCaretUtils.js:6:7
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
   }
-  if (header.column.getIsSorted() === "desc") {
+  if (header.column.getIsSorted() !== "desc") {
     return "🔽";
   }
killedBy: SortCaret tests Empty when is not sorted
statusReason: expect(element).toBeEmptyDOMElement()

Received:
  "🔽"
