[Killed] ArrayDeclaration
src/main/utils/useLogout.js:11:50
   const mutation = useMutation({
     mutationFn: async () => {
       await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
+      await queryClient.resetQueries({ queryKey: [] });
       navigate("/");
     },
killedBy: useLogout tests should log out the user, reset queries, and navigate to home
statusReason: expected "resetQueries" to be called with arguments: [ { queryKey: [ 'current user' ] } ]

Received: 

  1st resetQueries call:

  [
    {
